load-generator/test300s5peakhot.yml
config:
  http:
    timeout: 120
  phases:
  - arrivalRate: 0
    duration: 300
    rampTo: 5
  - arrivalRate: 5
    duration: 180
  - arrivalRate: 5
    duration: 300
    rampTo: 0.1
  - arrivalRate: 0.1
    duration: 120

  - arrivalRate: 0
    duration: 300
    rampTo: 5
  - arrivalRate: 5
    duration: 180
  - arrivalRate: 5
    duration: 300
    rampTo: 0.1
  - arrivalRate: 0.1
    duration: 480
  processor: ./metrics.js
scenarios:
- flow:
  - get:
      afterResponse: afterResponse
      beforeRequest: beforeRequest
      url: /function/primality