load-generator/test30s5peakhot.yml
config:
  http:
    timeout: 120

  phases:
  - arrivalRate: 0
    duration: 30
    rampTo: 5
  - arrivalRate: 5
    duration: 180
  - arrivalRate: 5
    duration: 30
    rampTo: 0.1
  - arrivalRate: 0.1
    duration: 120

  - arrivalRate: 0
    duration: 30
    rampTo: 5
  - arrivalRate: 5
    duration: 180
  - arrivalRate: 5
    duration: 30
    rampTo: 0.1
  - arrivalRate: 0.1
    duration: 480
  processor: "./metrics.js"
scenarios:
  - flow:
      - get:
          url: "/function/primality"
          beforeRequest: "beforeRequest"
          afterResponse: "afterResponse"